Pan Pizza

Eh ’em. Calling all lovers of thick, pillowy pizza crust! This epic homemade pan pizza tastes just like the thick crust pizza from your favorite pizzeria. The smell wafting from the oven is enough to make you visibly drool (we did!). Cooking in a cast iron skillet makes the crust crispy on the outside and soft on the inside: and the cheese goes all the way to the edges. These supreme-style toppings with gooey cheese and garlicky tomato sauce…well, it’s true perfection. Side benefit: it’s easy to make, too. Here’s how to make the best pan pizza!
Here’s how to make incredible pan pizza at home! It’s got thick pillowy crust and tastes like your favorite pizzeria…but even better.

How to make pan pizza: an overview

Make the dough	15 minutes active
Proof dough in skillet	45 minutes to 1 hour, inactive
Proof dough again (and prep toppings)	45 minutes, inactive (use time to prep toppings)
Top and bake pizza	15 minutes, inactive


How to make pan pizza

You’ll need a 10″ cast iron skillet
The only equipment you’ll need to make pan pizza is a cast iron skillet! You’ll need a 10-inch skillet for this recipe, because the dough size is designed especially to fit this pan. (What else to cook in cast iron? Go to 15 Great Cast Iron Skillet Recipes.)

The trick to extra thick crust: two proofs!
If you’ve baked bread before, you’ll know the term “proof”. Proofing is when you let bread dough rest after you’ve added yeast, so that it rises. The trick to getting the extra thick crust in this recipe is proofing the dough twice. The downside is that you’ll need to wait for 45 minutes not once but twice. The up-side is that you’ll get super thick, pillowy crust.

Another pro to making a skillet pan pizza: you don’t have to worry about shaping the dough! No throwing pizza dough in the air, or getting frustrated when it tears. Just proof it in the skillet, then press it out into the dough. It’s so simple!

Dough in cast iron skillet


This pizza sauce is a must
When you think about toppings for pan pizza, you can use anything you like. Just make sure to make our Best Pizza Sauce! It is full of incredible flavor and makes any pizza taste like you just stepped into a pizzeria. Even better, it takes just 5 minutes to make. Please. We beg of you. Make this sauce! Go to Best Pizza Sauce for the recipe.

Top your pan pizza with these epic supreme toppings!
OK, so here’s the deal. You can top this pan pizza with cheese and pepperoni if you’d like. But might we suggest topping with these epic supreme toppings? Typically we encourage creativity (and we do!). But you’ve got to try these toppings at least once. They make your house smell like you just stepped into a pizzeria. And they taste, well…epic. Here’s the breakdown:

Mozzarella and Parmesan cheese (lots of it!)
Mushroom sauteed with fennel seed = tastes like sausage!
Bell peppers
Red onion
Dried oregano
Best skillet pan pizza


Pan pizza baking technique: stovetop then oven!
One last note about the technique for a pan pizza. The first thing you’ll do once you’ve topped your pizza is not put it in the oven. Nope, you’ll put it on a stovetop burner first and cook for 2 minutes. This makes sure that the bottom heats up just enough before it gets into the oven, making for the perfect crispy crust bottom. Trust us on this one!

Keep in mind: you can only make one (unless you have 2 skillets!)
This pan pizza recipe is made right in the cast iron skillet: you’ll rise the dough there for 1.5 hours, then press it in. Because of that, you can only make one pizza at once. Unless of course, you have two 10-inch cast iron skillets! (If so, can we be friends?)

That might not sound like enough. But guess what? The crust of a pan pizza is very thick, making it much more filling than a thin crust pizza. Typically Alex and I have at least 2 pizzas for our family (2 adults plus 3 year old), but with a pan pizza we can get by with one. Just make sure to accessorize with a salad or side.


Ways to serve this pan pizza
Because you can only make one pan pizza at once, it’s an excuse to get creative on side dishes! It’s easy for Alex and me to load up on pizza, so we like the added challenge with this pan pizza. Here’s what we like to serve with it:

Perfect Italian Salad This salad will amaze everyone around the table! Homemade Italian dressing, crisp veggies and Parmesan cheese combine into one extraordinary salad.
Easy Arugula Salad The simplest salad you’ll ever make! This easy arugula salad is fool-proof: you don’t even need to make dressing. It comes together in minutes!
Spinach Apple Salad So easy and SO good, it will be your new go-to! No one will believe it took minutes to put together.
Simple Citrus Salad This refreshingly simple citrus salad features grapefruit and oranges topped with a tangy vinaigrette and fresh mint.
