Pizza Supreme

This Supreme Pizza recipe is fully loaded with our favorite meats, veggies, and a generous helping of melty cheese!

Why order pizza when it is so much fun to make at home? Supreme Pizza has all the popular toppings you’d expect and the crust can be made as thin or thick as you like!

top view of slice being taken out of a Supreme Pizza
This recipe starts with a homemade pizza crust (and pizza sauce too!) for the best flavor.

Supreme Pizza Toppings
The list of toppings for supreme pizza can vary but the following are our favorites:

Easy Rotel Dip
MEAT – pepperoni, sausage, salami, ham

VEGGIES – red onions, mushrooms, bell peppers, and olives.

CHEESE – Mozzarella and parmesan add great flavor don’t be shy, add lots! You can also go for a four cheese pizza blend (or a bought blend to save time).

ingredients to make a Supreme Pizza
More Great Additions
Try any of the following:

spicy – jalapenos, chili flakes, banana peppers
fresh – diced tomatoes, basil, fennel
meaty – ground beef, Canadian bacon (or regular bacon)
Time Saving Tips
Looking to save time? Here are some great shortcuts.

make big batches of pizza dough and sauce and freeze for pizza night
use pre-made dough (Italian markets often sell great pizza dough)
pre-shredded cheese blends are perfect on pizza
close up of ingredients on a Supreme Pizza
How to Make a Supreme Pizza
Homemade pizza has never been so easy! Just read on for a basic overview of the steps!

Prepare dough and while it is rising, prep ingredients.
Top pizza with sauce, toppings and of course cheese.
Bake until bubbly and browned.
Let pizza sit about 10 minutes before slicing and serving, this keeps the cheese from sliding off.

PRO TIP: Before adding the oil to the prepared pizza dough, poke the surface of both crusts with a fork. This is called “docking” and prevents large bubbles from forming on the crust. It’s what professional pizzaiolos do!

How to Store & Reheat Leftover Pizza
Nothing tastes better than leftover pizza! Even when it’s cold, it’s great for breakfast or a snack the next day!
Why not put a leftover slice or two in a lunch box to reheat at school or work?
This quick guide will show you the best way to reheat pizza for crispy, delicious slices every time!
